In [3]:
#Step 1. Import the necessary libraries
import pandas as pd
import numpy as np
import random


#Step 2. Create 3 differents Series, each of length 100, as follows:
#• The first a random number from 1 to 4
#• The second a random number from 1 to 3
#• The third a random number from 10,000 to 30,000
s1 = pd.Series(np.random.randint(1,5,100))
s2 = pd.Series(np.random.randint(1,4,100))
s3 = pd.Series(np.random.randint(10000,30000,100))

#Step 3. Create a DataFrame by joinning the Series by column
SC = pd.concat([s1, s2, s3], axis=1)
SC.head()

   0  1      2
0  4  2  26523
1  2  3  11863
2  2  1  19180
3  1  3  27447
4  3  2  27119

In [4]:
#Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter
SC.columns = ['bedrs','bathrs','price_sqr_meter']
SC.head()

   bedrs  bathrs  price_sqr_meter
0      4       2            26523
1      2       3            11863
2      2       1            19180
3      1       3            27447
4      3       2            27119

In [5]:
#Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'
bigcolumn = pd.concat([s1,s2,s3],axis=0)
bigcolumn

0         4
1         2
2         2
3         1
4         3
      ...
95    27671
96    13652
97    14604
98    29339
99    15192
Length: 300, dtype: int32

In [6]:
#Step 6. Ops it seems it is going only until index 99. Is it true?
len(bigcolumn)

300

In [7]:
#Step 7. Reindex the DataFrame so it goes from 0 to 299
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

0          4
1          2
2          2
3          1
4          3
       ...
295    27671
296    13652
297    14604
298    29339
299    15192
Length: 300, dtype: int32